OpenPuya/PY32T020_Firmware/Drivers/CMSIS/Device/PY32T020/Include/py32t020x5.h
#define SYSCFG_CFGR1_ETR_SRC_TIM1_Pos             (8U)
#define SYSCFG_CFGR1_ETR_SRC_TIM1_Msk             (0x3UL << SYSCFG_CFGR1_ETR_SRC_TIM1_Pos) /*!< 0x00000300 */
#define SYSCFG_CFGR1_ETR_SRC_TIM1                 SYSCFG_CFGR1_ETR_SRC_TIM1_Msk            /*!< TIM1 ETR input source */
#define SYSCFG_CFGR1_ETR_SRC_TIM1_0               (0x1UL << SYSCFG_CFGR1_ETR_SRC_TIM1_Pos) /*!< 0x00000100 */
#define SYSCFG_CFGR1_ETR_SRC_TIM1_1               (0x2UL << SYSCFG_CFGR1_ETR_SRC_TIM1_Pos) /*!< 0x00000200 */

/******************  Bit definition for SYSCFG_CFGR2 register  ****************/
#define SYSCFG_CFGR2_LOCKUP_LOCK_Pos              (0U)
#define SYSCFG_CFGR2_LOCKUP_LOCK_Msk              (0x1UL << SYSCFG_CFGR2_LOCKUP_LOCK_Pos)          /*!< 0x00000001 */
#define SYSCFG_CFGR2_LOCKUP_LOCK                  SYSCFG_CFGR2_LOCKUP_LOCK_Msk                     /*!< Enables and locks the LOCKUP_LOCK (Hardfault) output of CortexM0 with Break Input of TIMER1 */

#define SYSCFG_CFGR2_COMP1_BRK_TIM1_Pos           (3U)
#define SYSCFG_CFGR2_COMP1_BRK_TIM1_Msk           (0x1UL << SYSCFG_CFGR2_COMP1_BRK_TIM1_Pos)       /*!< 0x00000008 */
#define SYSCFG_CFGR2_COMP1_BRK_TIM1               SYSCFG_CFGR2_COMP1_BRK_TIM1_Msk                  /*!< COMP1_BRK_TIM1 */

#define SYSCFG_CFGR2_COMP2_BRK_TIM1_Pos           (4U)
#define SYSCFG_CFGR2_COMP2_BRK_TIM1_Msk           (0x1UL << SYSCFG_CFGR2_COMP2_BRK_TIM1_Pos)       /*!< 0x00000010 */
#define SYSCFG_CFGR2_COMP2_BRK_TIM1               SYSCFG_CFGR2_COMP2_BRK_TIM1_Msk                  /*!< COMP2_BRK_TIM1 */

#define SYSCFG_CFGR2_COMP1_OCREF_CLR_TIM1_Pos     (9U)
#define SYSCFG_CFGR2_COMP1_OCREF_CLR_TIM1_Msk     (0x1UL << SYSCFG_CFGR2_COMP1_OCREF_CLR_TIM1_Pos) /*!< 0x00000200 */
#define SYSCFG_CFGR2_COMP1_OCREF_CLR_TIM1         SYSCFG_CFGR2_COMP1_OCREF_CLR_TIM1_Msk            /*!< COMP1 output clear TIM1 ocref */

#define SYSCFG_CFGR2_COMP2_OCREF_CLR_TIM1_Pos     (11U)
#define SYSCFG_CFGR2_COMP2_OCREF_CLR_TIM1_Msk     (0x1UL << SYSCFG_CFGR2_COMP2_OCREF_CLR_TIM1_Pos) /*!< 0x00000800 */
#define SYSCFG_CFGR2_COMP2_OCREF_CLR_TIM1         SYSCFG_CFGR2_COMP2_OCREF_CLR_TIM1_Msk            /*!< COMP2 output clear TIM1 ocref */

/*****************  Bit definition for PA_ENS register  ************************/
#define SYSCFG_PAENS_Pos                          (0U)
#define SYSCFG_PAENS_Msk                          (0xFFFFUL << SYSCFG_PAENS_Pos)      /*!< 0x0000FFFF */
#define SYSCFG_PAENS                              SYSCFG_PAENS_Msk
#define SYSCFG_PAENS_0                            (0x1UL << SYSCFG_PAENS_Pos)         /*!< 0x00000001 */
#define SYSCFG_PAENS_1                            (0x2UL << SYSCFG_PAENS_Pos)         /*!< 0x00000002 */  
#define SYSCFG_PAENS_2                            (0x4UL << SYSCFG_PAENS_Pos)         /*!< 0x00000004 */  
#define SYSCFG_PAENS_3                            (0x8UL << SYSCFG_PAENS_Pos)         /*!< 0x00000008 */  
#define SYSCFG_PAENS_4                            (0x10UL << SYSCFG_PAENS_Pos)        /*!< 0x00000010 */  
#define SYSCFG_PAENS_5                            (0x20UL << SYSCFG_PAENS_Pos)        /*!< 0x00000020 */  
#define SYSCFG_PAENS_6                            (0x40UL << SYSCFG_PAENS_Pos)        /*!< 0x00000040 */  
#define SYSCFG_PAENS_7                            (0x80UL << SYSCFG_PAENS_Pos)        /*!< 0x00000080 */  
#define SYSCFG_PAENS_8                            (0x100UL << SYSCFG_PAENS_Pos)       /*!< 0x00000100 */  
#define SYSCFG_PAENS_9                            (0x200UL << SYSCFG_PAENS_Pos)       /*!< 0x00000200 */  
#define SYSCFG_PAENS_10                           (0x400UL << SYSCFG_PAENS_Pos)       /*!< 0x00000400 */  
#define SYSCFG_PAENS_11                           (0x800UL << SYSCFG_PAENS_Pos)       /*!< 0x00000800 */  
#define SYSCFG_PAENS_12                           (0x1000UL << SYSCFG_PAENS_Pos)      /*!< 0x00001000 */  
#define SYSCFG_PAENS_13                           (0x2000UL << SYSCFG_PAENS_Pos)      /*!< 0x00002000 */                             
#define SYSCFG_PAENS_14                           (0x4000UL << SYSCFG_PAENS_Pos)      /*!< 0x00004000 */  
#define SYSCFG_PAENS_15                           (0x8000UL << SYSCFG_PAENS_Pos)      /*!< 0x00008000 */  

/*****************  Bit definition for PB_ENS register  ************************/
#define SYSCFG_PBENS_Pos                          (0U)
#define SYSCFG_PBENS_Msk                          (0xFUL << SYSCFG_PBENS_Pos)         /*!< 0x0000000F */
#define SYSCFG_PBENS                              SYSCFG_PBENS_Msk
#define SYSCFG_PBENS_0                            (0x1UL << SYSCFG_PBENS_Pos)         /*!< 0x00000001 */
#define SYSCFG_PBENS_1                            (0x2UL << SYSCFG_PBENS_Pos)         /*!< 0x00000002 */  
#define SYSCFG_PBENS_2                            (0x4UL << SYSCFG_PBENS_Pos)         /*!< 0x00000004 */  
#define SYSCFG_PBENS_3                            (0x8UL << SYSCFG_PBENS_Pos)         /*!< 0x00000008 */  

/*****************  Bit definition for PF_ENS register  ************************/
#define SYSCFG_PFENS_Pos                          (0U)
#define SYSCFG_PFENS_Msk                          (0x3FUL << SYSCFG_PFENS_Pos)        /*!< 0x0000001F */
#define SYSCFG_PFENS                              SYSCFG_PFENS_Msk
#define SYSCFG_PFENS_0                            (0x1UL << SYSCFG_PFENS_Pos)         /*!< 0x00000001 */
#define SYSCFG_PFENS_1                            (0x2UL << SYSCFG_PFENS_Pos)         /*!< 0x00000002 */  
#define SYSCFG_PFENS_2                            (0x4UL << SYSCFG_PFENS_Pos)         /*!< 0x00000004 */  
#define SYSCFG_PFENS_3                            (0x8UL << SYSCFG_PFENS_Pos)         /*!< 0x00000008 */ 
#define SYSCFG_PFENS_4                            (0x10UL << SYSCFG_PFENS_Pos)        /*!< 0x00000010 */ 
#define SYSCFG_PFENS_5                            (0x20UL << SYSCFG_PFENS_Pos)        /*!< 0x00000020 */ 

/*****************  Bit definition for IOCFG register  ************************/
#define SYSCFG_IOCFG_PA_EIIC_Pos                  (0U)
#define SYSCFG_IOCFG_PA_EIIC_Msk                  (0x3UL << SYSCFG_IOCFG_PA_EIIC_Pos)         /*!< 0x0000003 */
#define SYSCFG_IOCFG_PA_EIIC                      SYSCFG_IOCFG_PA_EIIC_Msk                    /*!< PA_EIIC[1:0] bits */
#define SYSCFG_IOCFG_PA_EIIC_0                    (0x1UL << SYSCFG_IOCFG_PA_EIIC_Pos)         /*!< 0x00000001 */ 
#define SYSCFG_IOCFG_PA_EIIC_1                    (0x2UL << SYSCFG_IOCFG_PA_EIIC_Pos)         /*!< 0x00000002 */ 

