OpenPuya/PY32T020_Firmware/Drivers/CMSIS/Device/PY32T020/Include/py32t020x5.h
#define SYSCFG_IOCFG_PF_EIIC_Pos                  (2U)
#define SYSCFG_IOCFG_PF_EIIC_Msk                  (0x7UL << SYSCFG_IOCFG_PF_EIIC_Pos)         /*!< 0x0000001C */
#define SYSCFG_IOCFG_PF_EIIC                      SYSCFG_IOCFG_PF_EIIC_Msk                    /*!< PF_EIIC[2:0] bits */
#define SYSCFG_IOCFG_PF_EIIC_0                    (0x1UL << SYSCFG_IOCFG_PF_EIIC_Pos)         /*!< 0x00000001 */ 
#define SYSCFG_IOCFG_PF_EIIC_1                    (0x2UL << SYSCFG_IOCFG_PF_EIIC_Pos)         /*!< 0x00000002 */ 
#define SYSCFG_IOCFG_PF_EIIC_2                    (0x4UL << SYSCFG_IOCFG_PF_EIIC_Pos)         /*!< 0x00000004 */

#define SYSCFG_IOCFG_PF_PU_IIC_Pos                (6U)
#define SYSCFG_IOCFG_PF_PU_IIC_Msk                (0x3UL << SYSCFG_IOCFG_PF_PU_IIC_Pos)       /*!< 0x000000C0 */
#define SYSCFG_IOCFG_PF_PU_IIC                    SYSCFG_IOCFG_PF_PU_IIC_Msk                  /*!< PF_PU_IIC[1:0] bits */
#define SYSCFG_IOCFG_PF_PU_IIC_0                  (0x1UL << SYSCFG_IOCFG_PF_PU_IIC_Pos)       /*!< 0x00000001 */ 
#define SYSCFG_IOCFG_PF_PU_IIC_1                  (0x2UL << SYSCFG_IOCFG_PF_PU_IIC_Pos)       /*!< 0x00000002 */ 

#define SYSCFG_IOCFG_PA_EHS_Pos                   (8U)
#define SYSCFG_IOCFG_PA_EHS_Msk                   (0x1FUL << SYSCFG_IOCFG_PA_EHS_Pos)         /*!< 0x00001F00 */
#define SYSCFG_IOCFG_PA_EHS                       SYSCFG_IOCFG_PA_EHS_Msk                     /*!< PA_EHS[4:0] bits */
#define SYSCFG_IOCFG_PA_EHS_0                     (0x1UL << SYSCFG_IOCFG_PA_EHS_Pos)          /*!< 0x00000001 */  
#define SYSCFG_IOCFG_PA_EHS_1                     (0x2UL << SYSCFG_IOCFG_PA_EHS_Pos)          /*!< 0x00000002 */  
#define SYSCFG_IOCFG_PA_EHS_2                     (0x4UL << SYSCFG_IOCFG_PA_EHS_Pos)          /*!< 0x00000004 */  
#define SYSCFG_IOCFG_PA_EHS_3                     (0x8UL << SYSCFG_IOCFG_PA_EHS_Pos)          /*!< 0x00000008 */  
#define SYSCFG_IOCFG_PA_EHS_4                     (0x10UL << SYSCFG_IOCFG_PA_EHS_Pos)         /*!< 0x00000010 */    

#define SYSCFG_IOCFG_PA_IODRVP_Pos                (13U)
#define SYSCFG_IOCFG_PA_IODRVP_Msk                (0x3UL << SYSCFG_IOCFG_PA_IODRVP_Pos)       /*!< 0x00006000 */
#define SYSCFG_IOCFG_PA_IODRVP                    SYSCFG_IOCFG_PA_IODRVP_Msk                  /*!< PA_IODRVP[1:0] bits */
#define SYSCFG_IOCFG_PA_IODRVP_0                  (0x1UL << SYSCFG_IOCFG_PA_IODRVP_Pos)       /*!< 0x00000001 */          
#define SYSCFG_IOCFG_PA_IODRVP_1                  (0x2UL << SYSCFG_IOCFG_PA_IODRVP_Pos)       /*!< 0x00000002 */ 

#define SYSCFG_IOCFG_PA_ENSEG_Pos                 (16U)
#define SYSCFG_IOCFG_PA_ENSEG_Msk                 (0x3FUL << SYSCFG_IOCFG_PA_ENSEG_Pos)       /*!< 0x003F0000 */
#define SYSCFG_IOCFG_PA_ENSEG                     SYSCFG_IOCFG_PA_ENSEG_Msk                   /*!< PA_ENSEG[5:0] bits */
#define SYSCFG_IOCFG_PA_ENSEG_0                   (0x1UL << SYSCFG_IOCFG_PA_ENSEG_Pos)        /*!< 0x00000001 */ 
#define SYSCFG_IOCFG_PA_ENSEG_1                   (0x2UL << SYSCFG_IOCFG_PA_ENSEG_Pos)        /*!< 0x00000002 */   
#define SYSCFG_IOCFG_PA_ENSEG_2                   (0x4UL << SYSCFG_IOCFG_PA_ENSEG_Pos)        /*!< 0x00000004 */   
#define SYSCFG_IOCFG_PA_ENSEG_3                   (0x8UL << SYSCFG_IOCFG_PA_ENSEG_Pos)        /*!< 0x00000008 */    
#define SYSCFG_IOCFG_PA_ENSEG_4                   (0x10UL << SYSCFG_IOCFG_PA_ENSEG_Pos)       /*!< 0x00000010 */   
#define SYSCFG_IOCFG_PA_ENSEG_5                   (0x20UL << SYSCFG_IOCFG_PA_ENSEG_Pos)       /*!< 0x00000020 */  

#define SYSCFG_IOCFG_PB_ENSEG_Pos                 (22U)
#define SYSCFG_IOCFG_PB_ENSEG_Msk                 (0x3UL << SYSCFG_IOCFG_PB_ENSEG_Pos)        /*!< 0x00C00000 */
#define SYSCFG_IOCFG_PB_ENSEG                     SYSCFG_IOCFG_PB_ENSEG_Msk                   /*!< PB_ENSEG[1:0] bits */
#define SYSCFG_IOCFG_PB_ENSEG_0                   (0x1UL << SYSCFG_IOCFG_PB_ENSEG_Pos)        /*!< 0x00000001 */ 
#define SYSCFG_IOCFG_PB_ENSEG_1                   (0x2UL << SYSCFG_IOCFG_PB_ENSEG_Pos)        /*!< 0x00000002 */ 

/*****************  Bit definition for PA_ANA2EN register  ************************/
#define SYSCFG_PA_ANA2EN_Pos                      (0U)
#define SYSCFG_PA_ANA2EN_Msk                      (0xFFFFUL << SYSCFG_PA_ANA2EN_Pos)          /*!< 0x0000FFFF */
#define SYSCFG_PA_ANA2EN                          SYSCFG_PA_ANA2EN_Msk                         

/*****************  Bit definition for PB_ANA2EN register  ************************/
#define SYSCFG_PB_ANA2EN_Pos                      (0U)
#define SYSCFG_PB_ANA2EN_Msk                      (0xFUL << SYSCFG_PB_ANA2EN_Pos)             /*!< 0x0000001F */
#define SYSCFG_PB_ANA2EN                          SYSCFG_PB_ANA2EN_Msk                         

/*****************  Bit definition for PF_ANA2EN register  ************************/
#define SYSCFG_PF_ANA2EN_Pos                      (0U)
#define SYSCFG_PF_ANA2EN_Msk                      (0x3FUL << SYSCFG_PF_ANA2EN_Pos)            /*!< 0x0000003F */
#define SYSCFG_PF_ANA2EN                          SYSCFG_PF_ANA2EN_Msk                         

/*****************  Bit definition for PA_IORP register  ************************/
#define SYSCFG_PA_IORP_PA0_IORP_Pos               (0U)
#define SYSCFG_PA_IORP_PA0_IORP_Msk               (0x3UL << SYSCFG_PA_IORP_PA0_IORP_Pos)         /*!< 0x00000003 */
#define SYSCFG_PA_IORP_PA0_IORP                   SYSCFG_PA_IORP_PA0_IORP_Msk                    
#define SYSCFG_PA_IORP_PA0_IORP_0                 (0x1UL << SYSCFG_PA_IORP_PA0_IORP_Pos)         /*!< 0x00000001 */ 
#define SYSCFG_PA_IORP_PA0_IORP_1                 (0x2UL << SYSCFG_PA_IORP_PA0_IORP_Pos)         /*!< 0x00000002 */ 

#define SYSCFG_PA_IORP_PA1_IORP_Pos               (2U)
#define SYSCFG_PA_IORP_PA1_IORP_Msk               (0x3UL << SYSCFG_PA_IORP_PA1_IORP_Pos)         /*!< 0x0000000C */
#define SYSCFG_PA_IORP_PA1_IORP                   SYSCFG_PA_IORP_PA1_IORP_Msk                    
#define SYSCFG_PA_IORP_PA1_IORP_0                 (0x1UL << SYSCFG_PA_IORP_PA1_IORP_Pos)         /*!< 0x00000004 */ 
#define SYSCFG_PA_IORP_PA1_IORP_1                 (0x2UL << SYSCFG_PA_IORP_PA1_IORP_Pos)         /*!< 0x00000008 */ 

#define SYSCFG_PA_IORP_PA2_IORP_Pos               (4U)
#define SYSCFG_PA_IORP_PA2_IORP_Msk               (0x3UL << SYSCFG_PA_IORP_PA2_IORP_Pos)         /*!< 0x00000030 */
#define SYSCFG_PA_IORP_PA2_IORP                   SYSCFG_PA_IORP_PA2_IORP_Msk                    
#define SYSCFG_PA_IORP_PA2_IORP_0                 (0x1UL << SYSCFG_PA_IORP_PA2_IORP_Pos)         /*!< 0x00000010 */ 
#define SYSCFG_PA_IORP_PA2_IORP_1                 (0x2UL << SYSCFG_PA_IORP_PA2_IORP_Pos)         /*!< 0x00000020 */ 

#define SYSCFG_PA_IORP_PA3_IORP_Pos               (6U)
#define SYSCFG_PA_IORP_PA3_IORP_Msk               (0x3UL << SYSCFG_PA_IORP_PA3_IORP_Pos)         /*!< 0x000000C0 */
#define SYSCFG_PA_IORP_PA3_IORP                   SYSCFG_PA_IORP_PA3_IORP_Msk                    
#define SYSCFG_PA_IORP_PA3_IORP_0                 (0x1UL << SYSCFG_PA_IORP_PA3_IORP_Pos)         /*!< 0x00000040 */ 
#define SYSCFG_PA_IORP_PA3_IORP_1                 (0x2UL << SYSCFG_PA_IORP_PA3_IORP_Pos)         /*!< 0x00000080 */ 

#define SYSCFG_PA_IORP_PA4_IORP_Pos               (8U)
#define SYSCFG_PA_IORP_PA4_IORP_Msk               (0x3UL << SYSCFG_PA_IORP_PA4_IORP_Pos)         /*!< 0x00000300 */
#define SYSCFG_PA_IORP_PA4_IORP                   SYSCFG_PA_IORP_PA4_IORP_Msk                    
#define SYSCFG_PA_IORP_PA4_IORP_0                 (0x1UL << SYSCFG_PA_IORP_PA4_IORP_Pos)         /*!< 0x00000100 */ 
#define SYSCFG_PA_IORP_PA4_IORP_1                 (0x2UL << SYSCFG_PA_IORP_PA4_IORP_Pos)         /*!< 0x00000200 */ 

