OpenPuya/PY32T020_Firmware/Drivers/CMSIS/Device/PY32T020/Include/py32t020x5.h
#define SYSCFG_PB_IORP_PB2_IORP_Pos               (4U)
#define SYSCFG_PB_IORP_PB2_IORP_Msk               (0x3UL << SYSCFG_PB_IORP_PB2_IORP_Pos)         /*!< 0x00000030 */
#define SYSCFG_PB_IORP_PB2_IORP                   SYSCFG_PB_IORP_PB2_IORP_Msk                    
#define SYSCFG_PB_IORP_PB2_IORP_0                 (0x1UL << SYSCFG_PB_IORP_PB2_IORP_Pos)         /*!< 0x00000010 */ 
#define SYSCFG_PB_IORP_PB2_IORP_1                 (0x2UL << SYSCFG_PB_IORP_PB2_IORP_Pos)         /*!< 0x00000020 */ 

#define SYSCFG_PB_IORP_PB3_IORP_Pos               (6U)
#define SYSCFG_PB_IORP_PB3_IORP_Msk               (0x3UL << SYSCFG_PB_IORP_PB3_IORP_Pos)         /*!< 0x000000C0 */
#define SYSCFG_PB_IORP_PB3_IORP                   SYSCFG_PB_IORP_PB3_IORP_Msk                    
#define SYSCFG_PB_IORP_PB3_IORP_0                 (0x1UL << SYSCFG_PB_IORP_PB3_IORP_Pos)         /*!< 0x00000040 */ 
#define SYSCFG_PB_IORP_PB3_IORP_1                 (0x2UL << SYSCFG_PB_IORP_PB3_IORP_Pos)         /*!< 0x00000080 */ 

/*****************  Bit definition for PF_IORP register  ************************/
#define SYSCFG_PF_IORP_PF0_IORP_Pos               (0U)
#define SYSCFG_PF_IORP_PF0_IORP_Msk               (0x3UL << SYSCFG_PF_IORP_PF0_IORP_Pos)         /*!< 0x00000003 */
#define SYSCFG_PF_IORP_PF0_IORP                   SYSCFG_PF_IORP_PF0_IORP_Msk                    
#define SYSCFG_PF_IORP_PF0_IORP_0                 (0x1UL << SYSCFG_PF_IORP_PF0_IORP_Pos)         /*!< 0x00000001 */ 
#define SYSCFG_PF_IORP_PF0_IORP_1                 (0x2UL << SYSCFG_PF_IORP_PF0_IORP_Pos)         /*!< 0x00000002 */ 

#define SYSCFG_PF_IORP_PF1_IORP_Pos               (2U)
#define SYSCFG_PF_IORP_PF1_IORP_Msk               (0x3UL << SYSCFG_PF_IORP_PF1_IORP_Pos)         /*!< 0x0000000C */
#define SYSCFG_PF_IORP_PF1_IORP                   SYSCFG_PF_IORP_PF1_IORP_Msk                    
#define SYSCFG_PF_IORP_PF1_IORP_0                 (0x1UL << SYSCFG_PF_IORP_PF1_IORP_Pos)         /*!< 0x00000004 */ 
#define SYSCFG_PF_IORP_PF1_IORP_1                 (0x2UL << SYSCFG_PF_IORP_PF1_IORP_Pos)         /*!< 0x00000008 */ 

#define SYSCFG_PF_IORP_PF2_IORP_Pos               (4U)
#define SYSCFG_PF_IORP_PF2_IORP_Msk               (0x3UL << SYSCFG_PF_IORP_PF2_IORP_Pos)         /*!< 0x00000030 */
#define SYSCFG_PF_IORP_PF2_IORP                   SYSCFG_PF_IORP_PF2_IORP_Msk                    
#define SYSCFG_PF_IORP_PF2_IORP_0                 (0x1UL << SYSCFG_PF_IORP_PF2_IORP_Pos)         /*!< 0x00000010 */ 
#define SYSCFG_PF_IORP_PF2_IORP_1                 (0x2UL << SYSCFG_PF_IORP_PF2_IORP_Pos)         /*!< 0x00000020 */ 

#define SYSCFG_PF_IORP_PF3_IORP_Pos               (6U)
#define SYSCFG_PF_IORP_PF3_IORP_Msk               (0x3UL << SYSCFG_PF_IORP_PF3_IORP_Pos)         /*!< 0x000000C0 */
#define SYSCFG_PF_IORP_PF3_IORP                   SYSCFG_PF_IORP_PF3_IORP_Msk                    
#define SYSCFG_PF_IORP_PF3_IORP_0                 (0x1UL << SYSCFG_PF_IORP_PF3_IORP_Pos)         /*!< 0x00000040 */ 
#define SYSCFG_PF_IORP_PF3_IORP_1                 (0x2UL << SYSCFG_PF_IORP_PF3_IORP_Pos)         /*!< 0x00000080 */ 

#define SYSCFG_PF_IORP_PF4_IORP_Pos               (8U)
#define SYSCFG_PF_IORP_PF4_IORP_Msk               (0x3UL << SYSCFG_PF_IORP_PF4_IORP_Pos)         /*!< 0x00000300 */
#define SYSCFG_PF_IORP_PF4_IORP                   SYSCFG_PF_IORP_PF4_IORP_Msk                    
#define SYSCFG_PF_IORP_PF4_IORP_0                 (0x1UL << SYSCFG_PF_IORP_PF4_IORP_Pos)         /*!< 0x00000100 */ 
#define SYSCFG_PF_IORP_PF4_IORP_1                 (0x2UL << SYSCFG_PF_IORP_PF4_IORP_Pos)         /*!< 0x00000200 */ 

#define SYSCFG_PF_IORP_PF5_IORP_Pos               (10U)
#define SYSCFG_PF_IORP_PF5_IORP_Msk               (0x3UL << SYSCFG_PF_IORP_PF5_IORP_Pos)         /*!< 0x00000C00 */
#define SYSCFG_PF_IORP_PF5_IORP                   SYSCFG_PF_IORP_PF5_IORP_Msk                    
#define SYSCFG_PF_IORP_PF5_IORP_0                 (0x1UL << SYSCFG_PF_IORP_PF5_IORP_Pos)         /*!< 0x00000400 */ 
#define SYSCFG_PF_IORP_PF5_IORP_1                 (0x2UL << SYSCFG_PF_IORP_PF5_IORP_Pos)         /*!< 0x00000800 */ 

/*****************************************************************************/
/*                                                                           */
/*                               Timers (TIM)                                */
/*                                                                           */
/*****************************************************************************/
/*******************  Bit definition for TIM_CR1 register  *******************/
#define TIM_CR1_CEN_Pos           (0U)
#define TIM_CR1_CEN_Msk           (0x1UL << TIM_CR1_CEN_Pos)                    /*!< 0x00000001 */
#define TIM_CR1_CEN               TIM_CR1_CEN_Msk                               /*!<Counter enable */

#define TIM_CR1_UDIS_Pos          (1U)
#define TIM_CR1_UDIS_Msk          (0x1UL << TIM_CR1_UDIS_Pos)                   /*!< 0x00000002 */
#define TIM_CR1_UDIS              TIM_CR1_UDIS_Msk                              /*!<Update disable */

#define TIM_CR1_URS_Pos           (2U)
#define TIM_CR1_URS_Msk           (0x1UL << TIM_CR1_URS_Pos)                    /*!< 0x00000004 */
#define TIM_CR1_URS               TIM_CR1_URS_Msk                               /*!<Update request source */

#define TIM_CR1_OPM_Pos           (3U)
#define TIM_CR1_OPM_Msk           (0x1UL << TIM_CR1_OPM_Pos)                    /*!< 0x00000008 */
#define TIM_CR1_OPM               TIM_CR1_OPM_Msk                               /*!<One pulse mode */

#define TIM_CR1_DIR_Pos           (4U)
#define TIM_CR1_DIR_Msk           (0x1UL << TIM_CR1_DIR_Pos)                    /*!< 0x00000010 */
#define TIM_CR1_DIR               TIM_CR1_DIR_Msk                               /*!<Direction */

#define TIM_CR1_CMS_Pos           (5U)
#define TIM_CR1_CMS_Msk           (0x3UL << TIM_CR1_CMS_Pos)                    /*!< 0x00000060 */
#define TIM_CR1_CMS               TIM_CR1_CMS_Msk                               /*!<CMS[1:0] bits (Center-aligned mode selection) */
#define TIM_CR1_CMS_0             (0x1UL << TIM_CR1_CMS_Pos)                    /*!< 0x00000020 */
#define TIM_CR1_CMS_1             (0x2UL << TIM_CR1_CMS_Pos)                    /*!< 0x00000040 */

#define TIM_CR1_ARPE_Pos          (7U)
#define TIM_CR1_ARPE_Msk          (0x1UL << TIM_CR1_ARPE_Pos)                   /*!< 0x00000080 */
#define TIM_CR1_ARPE              TIM_CR1_ARPE_Msk                              /*!<Auto-reload preload enable */

#define TIM_CR1_CKD_Pos           (8U)
#define TIM_CR1_CKD_Msk           (0x3UL << TIM_CR1_CKD_Pos)                    /*!< 0x00000300 */
#define TIM_CR1_CKD               TIM_CR1_CKD_Msk                               /*!<CKD[1:0] bits (clock division) */
#define TIM_CR1_CKD_0             (0x1UL << TIM_CR1_CKD_Pos)                    /*!< 0x00000100 */
#define TIM_CR1_CKD_1             (0x2UL << TIM_CR1_CKD_Pos)                    /*!< 0x00000200 */

/*******************  Bit definition for TIM_CR2 register  *******************/
#define TIM_CR2_CCPC_Pos          (0U)
#define TIM_CR2_CCPC_Msk          (0x1UL << TIM_CR2_CCPC_Pos)                   /*!< 0x00000001 */
#define TIM_CR2_CCPC              TIM_CR2_CCPC_Msk                              /*!<Capture/Compare Preloaded Control */

#define TIM_CR2_CCUS_Pos          (2U)
#define TIM_CR2_CCUS_Msk          (0x1UL << TIM_CR2_CCUS_Pos)                   /*!< 0x00000004 */
#define TIM_CR2_CCUS              TIM_CR2_CCUS_Msk                              /*!<Capture/Compare Control Update Selection */

#define TIM_CR2_MMS_Pos           (4U)
#define TIM_CR2_MMS_Msk           (0x7UL << TIM_CR2_MMS_Pos)                    /*!< 0x00000070 */
#define TIM_CR2_MMS               TIM_CR2_MMS_Msk                               /*!<MMS[2:0] bits (Master Mode Selection) */
#define TIM_CR2_MMS_0             (0x1UL << TIM_CR2_MMS_Pos)                    /*!< 0x00000010 */
#define TIM_CR2_MMS_1             (0x2UL << TIM_CR2_MMS_Pos)                    /*!< 0x00000020 */
#define TIM_CR2_MMS_2             (0x4UL << TIM_CR2_MMS_Pos)                    /*!< 0x00000040 */

#define TIM_CR2_TI1S_Pos          (7U)
#define TIM_CR2_TI1S_Msk          (0x1UL << TIM_CR2_TI1S_Pos)                   /*!< 0x00000080 */
#define TIM_CR2_TI1S              TIM_CR2_TI1S_Msk                              /*!<TI1 Selection */

#define TIM_CR2_OIS1_Pos          (8U)
#define TIM_CR2_OIS1_Msk          (0x1UL << TIM_CR2_OIS1_Pos)                   /*!< 0x00000100 */
#define TIM_CR2_OIS1              TIM_CR2_OIS1_Msk                              /*!<Output Idle state 1 (OC1 output) */

