OpenPuya/PY32T020_Firmware/Drivers/CMSIS/Device/PY32T020/Include/py32t020x5.h
#define UART_SR_BRI_Pos                    (4U)
#define UART_SR_BRI_Msk                    (0x1UL << UART_SR_BRI_Pos)            /*!< 0x00000010 */
#define UART_SR_BRI                        UART_SR_BRI_Msk                       

#define UART_SR_TDRE_Pos                   (5U)
#define UART_SR_TDRE_Msk                   (0x1UL << UART_SR_TDRE_Pos)           /*!< 0x00000020 */
#define UART_SR_TDRE                       UART_SR_TDRE_Msk                      

#define UART_SR_TXE_Pos                    (6U)
#define UART_SR_TXE_Msk                    (0x1UL << UART_SR_TXE_Pos)            /*!< 0x00000040 */
#define UART_SR_TXE                        UART_SR_TXE_Msk                       /*!< Transmit Data Register Empty */

#define UART_SR_ADDR_RCVD_Pos              (8U)
#define UART_SR_ADDR_RCVD_Msk              (0x1UL << UART_SR_ADDR_RCVD_Pos)      /*!< 0x00000100 */
#define UART_SR_ADDR_RCVD                  UART_SR_ADDR_RCVD_Msk                 

#define UART_SR_BUSY_Pos                   (9U)
#define UART_SR_BUSY_Msk                   (0x1UL << UART_SR_BUSY_Pos)           /*!< 0x00000200 */
#define UART_SR_BUSY                       UART_SR_BUSY_Msk                      

#define UART_SR_BUSY_ERR_Pos               (10U)
#define UART_SR_BUSY_ERR_Msk               (0x1UL << UART_SR_BUSY_ERR_Pos)       /*!< 0x00000400 */
#define UART_SR_BUSY_ERR                   UART_SR_BUSY_ERR_Msk                

/******************  Bit definition for UART_CR1 register  *******************/
#define UART_CR1_M_Pos                     (0U)
#define UART_CR1_M_Msk                     (0x3UL << UART_CR1_M_Pos)             /*!< 0x00000003 */
#define UART_CR1_M                         UART_CR1_M_Msk                        
#define UART_CR1_M_0                       (0x1UL << UART_CR1_M_Pos)             /*!< 0x00000001 */
#define UART_CR1_M_1                       (0x2UL << UART_CR1_M_Pos)             /*!< 0x00000002 */

#define UART_CR1_STOP_Pos                  (2U)
#define UART_CR1_STOP_Msk                  (0x1UL << UART_CR1_STOP_Pos)          /*!< 0x00000004 */
#define UART_CR1_STOP                      UART_CR1_STOP_Msk                     

#define UART_CR1_PCE_Pos                   (3U)
#define UART_CR1_PCE_Msk                   (0x1UL << UART_CR1_PCE_Pos)           /*!< 0x00000008 */
#define UART_CR1_PCE                       UART_CR1_PCE_Msk                      

#define UART_CR1_PS_Pos                    (4U)
#define UART_CR1_PS_Msk                    (0x1UL << UART_CR1_PS_Pos)            /*!< 0x00000010 */
#define UART_CR1_PS                        UART_CR1_PS_Msk                       /*!< Parity Selection */

#define UART_CR1_SP_Pos                    (5U)
#define UART_CR1_SP_Msk                    (0x1UL << UART_CR1_SP_Pos)            /*!< 0x00000020 */
#define UART_CR1_SP                        UART_CR1_SP_Msk                       

#define UART_CR1_SBK_Pos                   (6U)
#define UART_CR1_SBK_Msk                   (0x1UL << UART_CR1_SBK_Pos)           /*!< 0x00000040 */
#define UART_CR1_SBK                       UART_CR1_SBK_Msk                      /*!< Send Break */

#define UART_CR1_SWAP_Pos                  (8U)
#define UART_CR1_SWAP_Msk                  (0x1UL << UART_CR1_SWAP_Pos)          /*!< 0x00000100 */
#define UART_CR1_SWAP                      UART_CR1_SWAP_Msk                     

#define UART_CR1_MSBFIRST_Pos              (9U)
#define UART_CR1_MSBFIRST_Msk              (0x1UL << UART_CR1_MSBFIRST_Pos)      /*!< 0x00000200 */
#define UART_CR1_MSBFIRST                  UART_CR1_MSBFIRST_Msk                 /*!< MSB First */

/******************  Bit definition for UART_CR2 register  *******************/
#define UART_CR2_RXNEIE_Pos                (0U)
#define UART_CR2_RXNEIE_Msk                (0x1UL << UART_CR2_RXNEIE_Pos)        /*!< 0x00000001 */
#define UART_CR2_RXNEIE                    UART_CR2_RXNEIE_Msk                   /*!< RXNE Interrupt Enable */

#define UART_CR2_TDREIE_Pos                (1U)
#define UART_CR2_TDREIE_Msk                (0x1UL << UART_CR2_TDREIE_Pos)        /*!< 0x00000002 */
#define UART_CR2_TDREIE                    UART_CR2_TDREIE_Msk                   /*!< TDRE Interrupt Enable */

#define UART_CR2_LSIE_Pos                  (2U)
#define UART_CR2_LSIE_Msk                  (0x1UL << UART_CR2_LSIE_Pos)          /*!< 0x00000004 */
#define UART_CR2_LSIE                      UART_CR2_LSIE_Msk                     /*!< LS Interrupt Enable */ 

#define UART_CR2_BUSYERRIE_Pos             (3U)
#define UART_CR2_BUSYERRIE_Msk             (0x1UL << UART_CR2_BUSYERRIE_Pos)     /*!< 0x00000008 */
#define UART_CR2_BUSYERRIE                 UART_CR2_BUSYERRIE_Msk                /*!< BUSYERR Interrupt Enable */

/******************  Bit definition for UART_CR3 register  *******************/
#define UART_CR3_M_E_Pos                   (0U)
#define UART_CR3_M_E_Msk                   (0x1UL << UART_CR3_M_E_Pos)           /*!< 0x00000001 */
#define UART_CR3_M_E                       UART_CR3_M_E_Msk                      

#define UART_CR3_ADDR_MATCH_Pos            (1U)
#define UART_CR3_ADDR_MATCH_Msk            (0x1UL << UART_CR3_ADDR_MATCH_Pos)    /*!< 0x00000002 */
#define UART_CR3_ADDR_MATCH                UART_CR3_ADDR_MATCH_Msk               

#define UART_CR3_SEND_ADDR_Pos             (2U)
#define UART_CR3_SEND_ADDR_Msk             (0x1UL << UART_CR3_SEND_ADDR_Pos)     /*!< 0x00000004 */
#define UART_CR3_SEND_ADDR                 UART_CR3_SEND_ADDR_Msk                

#define UART_CR3_TX_MODE_Pos               (3U)
#define UART_CR3_TX_MODE_Msk               (0x1UL << UART_CR3_TX_MODE_Pos)       /*!< 0x00000008 */
#define UART_CR3_TX_MODE                   UART_CR3_TX_MODE_Msk                  

/******************  Bit definition for UART_RAR register  *******************/
#define UART_RAR_RAR_Pos                   (0U)
#define UART_RAR_RAR_Msk                   (0xFFUL << UART_RAR_RAR_Pos)          /*!< 0x000000FF */
#define UART_RAR_RAR                       UART_RAR_RAR_Msk                     
#define UART_RAR_RAR_0                     (0x1UL<<UART_RAR_RAR_Pos)             /*!< 0x00000001 */
#define UART_RAR_RAR_1                     (0x2UL<<UART_RAR_RAR_Pos)             /*!< 0x00000002 */
#define UART_RAR_RAR_2                     (0x4UL<<UART_RAR_RAR_Pos)             /*!< 0x00000004 */
#define UART_RAR_RAR_3                     (0x8UL<<UART_RAR_RAR_Pos)             /*!< 0x00000008 */
#define UART_RAR_RAR_4                     (0x10UL<<UART_RAR_RAR_Pos)            /*!< 0x00000010 */
#define UART_RAR_RAR_5                     (0x20UL<<UART_RAR_RAR_Pos)            /*!< 0x00000020 */
#define UART_RAR_RAR_6                     (0x40UL<<UART_RAR_RAR_Pos)            /*!< 0x00000040 */
#define UART_RAR_RAR_7                     (0x80UL<<UART_RAR_RAR_Pos)            /*!< 0x00000080 */

/******************  Bit definition for UART_TAR register  *******************/
#define UART_TAR_TAR_Pos                   (0U)
#define UART_TAR_TAR_Msk                   (0xFFUL << UART_TAR_TAR_Pos)          /*!< 0x000000FF */
#define UART_TAR_TAR                       UART_TAR_TAR_Msk                      
#define UART_TAR_TAR_0                     (0x1UL<<UART_TAR_TAR_Pos)             /*!< 0x00000001 */
#define UART_TAR_TAR_1                     (0x2UL<<UART_TAR_TAR_Pos)             /*!< 0x00000002 */
#define UART_TAR_TAR_2                     (0x4UL<<UART_TAR_TAR_Pos)             /*!< 0x00000004 */
#define UART_TAR_TAR_3                     (0x8UL<<UART_TAR_TAR_Pos)             /*!< 0x00000008 */
#define UART_TAR_TAR_4                     (0x10UL<<UART_TAR_TAR_Pos)            /*!< 0x00000010 */
#define UART_TAR_TAR_5                     (0x20UL<<UART_TAR_TAR_Pos)            /*!< 0x00000020 */
#define UART_TAR_TAR_6                     (0x40UL<<UART_TAR_TAR_Pos)            /*!< 0x00000040 */
#define UART_TAR_TAR_7                     (0x80UL<<UART_TAR_TAR_Pos)            /*!< 0x00000080 */


/** @addtogroup Exported_macros
  * @{
  */

